# Duct Fitting And Accessory Pressure Drop Item Coefficient Property

Source: https://www.revitapidocs.com/2026/8018b4b0-5bda-bf52-b199-1eb25d21c31e.htm

---

| Duct Fitting And Accessory Pressure Drop Item Coefficient Property |
| --- |

The coefficient between the begin connector and end connector, unitless.
**Namespace:** Autodesk.Revit.DB.Mechanical
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double Coefficient { get; set; }
```

```
Public Property Coefficient As Double
	Get
	Set
```

```
public:
property double Coefficient {
	double get ();
	void set (double value);
}
```

```
member Coefficient : float with get, set
```

#### Property Value

Double See Also

#### Reference

DuctFittingAndAccessoryPressureDropItem Class Autodesk.Revit.DB.Mechanical Namespace